app/controllers/api_controller.rb

  def get_equipment_list
    ret = EquipmentList.all.map {|x| {id: x.id, name: x.name, description: x.description, images: x.image_list} }
---
SELECT "equipment_lists".* FROM "equipment_lists"

  def create_equipment
    params_check([:name, :description, :images], ['name:string', 'description:string', 'images:array'])
    value = {name: params[:name], description: params[:description], json_image_list: Oj.dump(params[:images])}
    EquipmentList.create(value)
---
INSERT INTO "equipment_lists" ("name", "description", "json_image_list", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "愛5555"], ["description", "愛5555"], ["json_image_list", "[\"123\"]"], ["created_at", "2020-07-21 03:32:30.036421"], ["updated_at", "2020-07-21 03:32:30.036421"]]

  def update_equipment
    params_check([:id], ['id:integer', 'name:string', 'description:string', 'images:array'])
    obj = EquipmentList.by_id(params[:id]).first
    return render_ret_code(DB_SEARCH_NOT_FOUND_FAIL) unless obj

    (obj.name = params[:name]) if params[:name]
    (obj.description = params[:description]) if params[:description]
    (obj.json_image_list = Oj.dump(params[:images])) if params[:images]
    ret = obj.save
---
UPDATE "equipment_lists" SET "name" = ?, "description" = ?, "json_image_list" = ?, "updated_at" = ? WHERE "equipment_lists"."id" = ?  [["name", "aaaaaa"], ["description", "bbb"], ["json_image_list", "[\"www.ccc.jpg\"]"], ["updated_at", "2020-07-21 03:38:41.075617"], ["id", 11]]

  def delete_equipment
    params_check([:id], ['id:integer'])
    ret = EquipmentList.delete(params[:id])
---
DELETE FROM "equipment_lists" WHERE "equipment_lists"."id" = ?  [["id", "6"]]

  def get_rental_request_list
    ret = RentalRequest.all.map do |x|
---
SELECT "rental_requests".* FROM "rental_requests"